# Runtime (REQUIRED — OpenClaw needs Node 24+)
brew "node@24"

# Core CLI tools
brew "bat"
brew "btop"
brew "chezmoi"
brew "gh"
brew "git"
brew "htop"
brew "jq"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "wget"
brew "zoxide"

# LLM serving (local fallback)
brew "ollama"

# Networking
cask "tailscale"
